
UNICODE_DICT: dict = {
    "\u2010": "-",
    "\u2013": "-",
    "\u2014": "-",
    "\u2212": "-",
    "\u25be": "-",
    "\u00b1": "+-", # "±",
    "\u2264": "<=", # "≤",
    "\u2265": ">=", # "≥",
    "\u2267": ">==", # "≧",
    "\u00d7": "*", # "×", # multiplication symbol
    "\u00b7": "*", # "·",
    "\u2219": "*", # "·",
    "\u2227": "&", # "∧", # logical and


    "\u03c7": "x", # "χ", # greek small letter X
    "\u03bc": "m", # "μ", # greek symbol mu
    "\u03b1": "a", # "α", # greek symbol alpha
    "\u03b2": "B", # "β", # greek symbol beta
    "\u03bd": "v", # "ν", # greek symbol vi
    "\u03b3": "Y", # "γ", # greek symbol gamma
    "\u03c3": "s", # "σ", # greek symbol sigma
    "\u03bb": "l", # "λ", # greek symbol lambda
    "\u00b5": "m", # "µ", # greek symbol micro
    "\u03b8": "O", # "θ", # greek symbol theta
    "\u03c9": "w", # "ω",
    "\u0394": "D", # "Δ",
    "\u03c1": "r", # "ρ",
    "\u03b4": "r", # "δ",
    "\u03c6": "p", # "φ",
    "\u03a3": "E", # "Σ",
    "\u03c4": "t", # "τ",
    "\u03b5": "e", # "ε",


    "\u2192": "->", # "→", 
    "\u00a0": " ",
    "\u00a7": "S", # "§",
    "\u00b6": "P", # "¶",
    "\u2009": " ",
    "\u200a": " ",
    "\u2003": " ",
    "\u2005": " ",
    "\u2018": "'",
    "\u2019": "'",
    "\u2026": "...",
    "\u2032": "'",
    "\u201d": "''",
    "\u2033": "''",
    "\u2217": "*",
    

    "\u00e9": "e", # "é", # e
    "\u00f1": "n", # "ñ", # n
    "\u00f2": "o", # "ò", # o
    "\u00f3": "o", # "ò", # o
    "\u00f6": "o", # "ö", # o
    "\u00f8": "o", # "ø", # o
    "\u00fc": "u", # "ü", # u
    "\u00d8": "o", # "ø", # o
    "\u00e5": "a", # "å", # a
    "\u00c5": "A", # "Å", # A
    "\u00ed": "i", # "ì", # i
    "\u017e": "z", # "ž", # z
    "\u03ce": "w", # "ώ", # w


    "\u2020": "T", # "†", 
    "\u2021": "T", # "‡",
    "\u2022": ".", # "·",
    "\u20ac": "euro", # "€",
    "\u00ba": "°",
    "\u00b0": "°",
    "\u00b2": "^2",
    "\u25b4": "^", # "▴",
    "\u221e": "inf", # "∞",

    "\xe2\x97": '' # unknown - end of line
}